Hi @nvibert and @gchek, below is a basic example that would address this use case. 

The example uses the following:
- Terraform v1.1.4
- Terraform Provider for VMware vSphere v2.0.2
- VMware vSphere v7.0.3c

### The basic plan.

`versions.tf`

```hcl
terraform {
  required_providers {
    vsphere = {
      source  = "hashicorp/vsphere"
      version = ">= 2.0.2"
    }
    time = {
      source  = "hashicorp/time"
      version = "0.7.2"
    }

  }
  required_version = ">= 1.1.4"
}
```

`variables.tf`

```hcl
# Credentials

variable "vsphere_server" {
  type        = string
  description = "The fully qualified domain name or IP address of the vCenter Server instance. (e.g. sfo-w02-vc01.sfo.rainpole.io)"
}

variable "vsphere_username" {
  type        = string
  description = "The username to login to the vCenter Server instance."
  sensitive   = true
}

variable "vsphere_password" {
  type        = string
  description = "The password for the login to the vCenter Server instance."
  sensitive   = true
}

variable "vsphere_insecure" {
  type        = bool
  description = "Set to true for self-signed certificates."
  default     = false
}

# vSphere Settings

variable "vsphere_datacenter" {
  type = string
}

variable "vsphere_cluster" {
  type = string
}

variable "vsphere_datastore" {
  type = string
}

variable "vsphere_folder" {
  type = string
}

variable "vsphere_network" {
  type = string
}

variable "vsphere_content_library_ovf" {
  type = string
}

# Content Library Settings

variable "vsphere_content_library_name" {
  type = string
}

variable "vsphere_content_library_description" {
  type = string
}

variable "vsphere_content_library_subscription_url" {
  type = string
}

variable "vsphere_content_library_automatic_sync" {
  type    = bool
  default = "true"
}

variable "vsphere_content_library_on_demand" {
  type    = bool
  default = "false"
}

# Virtual Machine Settings

variable "vm_name" {
  type = string
}

variable "vm_cpus" {
  type = number
}

variable "vm_memory" {
  type = number
}

variable "vm_disk_size" {
  type = number
}

variable "vm_firmware" {
  type = string
}

variable "vm_guest_id" {
  type = string
}

variable "vm_thin_provisioned" {
  type = bool
}

variable "vm_efi_secure_boot_enabled" {
  type = bool
}

variable "vm_hostname" {
  type = string
}

variable "vm_domain" {
  type = string
}

variable "vm_ipv4_address" {
  type = string
}

variable "vm_ipv4_netmask" {
  type = string
}

variable "vm_ipv4_gateway" {
  type = string
}

variable "vm_dns_suffix_list" {
  type = list(string)
}

variable "vm_dns_server_list" {
  type = list(string)
}
```

`main.tf`

```hcl
provider "vsphere" {
  vsphere_server       = var.vsphere_server
  user                 = var.vsphere_username
  password             = var.vsphere_password
  allow_unverified_ssl = var.vsphere_insecure
}

provider "time" {
}

data "vsphere_datacenter" "datacenter" {
  name = var.vsphere_datacenter
}

data "vsphere_network" "network" {
  name          = var.vsphere_network
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_compute_cluster" "cluster" {
  name          = var.vsphere_cluster
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_resource_pool" "pool" {
  name          = format("%s%s", data.vsphere_compute_cluster.cluster.name, "/Resources")
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_datastore" "datastore" {
  name          = var.vsphere_datastore
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_content_library" "content_library" {
  depends_on = [
    vsphere_content_library.content_library
  ]
  name = var.vsphere_content_library_name
}

data "vsphere_content_library_item" "content_library_item" {
  depends_on = [
    vsphere_content_library.content_library,
    time_sleep.nap
  ]
  name       = var.vsphere_content_library_ovf
  type       = "ovf"
  library_id = data.vsphere_content_library.content_library.id
}

resource "vsphere_content_library" "content_library" {
  name            = var.vsphere_content_library_name
  description     = var.vsphere_content_library_description
  storage_backing = toset([data.vsphere_datastore.datastore.id])
  subscription {
    subscription_url = var.vsphere_content_library_subscription_url
    automatic_sync   = var.vsphere_content_library_automatic_sync
    on_demand        = var.vsphere_content_library_on_demand
  }
}

resource "time_sleep" "nap" {
  depends_on = [
    vsphere_content_library.content_library
  ]
  create_duration = "120s"
}

resource "vsphere_virtual_machine" "vm" {
  depends_on = [
    data.vsphere_content_library_item.content_library_item
  ]
  name                    = var.vm_name
  folder                  = var.vsphere_folder
  num_cpus                = var.vm_cpus
  memory                  = var.vm_memory
  firmware                = var.vm_firmware
  efi_secure_boot_enabled = var.vm_efi_secure_boot_enabled
  guest_id                = var.vm_guest_id
  datastore_id            = data.vsphere_datastore.datastore.id
  resource_pool_id        = data.vsphere_resource_pool.pool.id
  network_interface {
    network_id = data.vsphere_network.network.id
  }
  disk {
    label            = "disk0"
    size             = var.vm_disk_size
    thin_provisioned = var.vm_thin_provisioned
    datastore_id     = data.vsphere_datastore.datastore.id
  }
  clone {
    template_uuid = data.vsphere_content_library_item.content_library_item.id
    customize {
      linux_options {
        host_name = var.vm_hostname
        domain    = var.vm_domain
      }
      network_interface {
        ipv4_address = var.vm_ipv4_address
        ipv4_netmask = var.vm_ipv4_netmask
      }

      ipv4_gateway    = var.vm_ipv4_gateway
      dns_suffix_list = var.vm_dns_suffix_list
      dns_server_list = var.vm_dns_server_list
    }
  }
  lifecycle {
    ignore_changes = [
      clone[0].template_uuid,
    ]
  }
}
```

`terraform.tfvars`

```hcl
# Credentials

vsphere_server   = "m01-vc01.rainpole.io"
vsphere_username = "administrator@vsphere.local"
vsphere_password = "VMware1!"
vsphere_insecure = true

# vSphere Settings

vsphere_datacenter = "m01-dc01"
vsphere_datastore  = "remote-nfs"
vsphere_cluster    = "m01-cl01"
vsphere_folder     = "workloads"
vsphere_network    = "M - 172.16.11.0"

# Content Library Settings

vsphere_content_library_ovf              = "linux-ubuntu-18.04lts-v22.01"
vsphere_content_library_name             = "m01-lib02"
vsphere_content_library_description      = "Subscribed Content Library for sfo-w02."
vsphere_content_library_subscription_url = "https://m01-vc01.rainpole.io:443/cls/vcsp/lib/93feb9f7-2926-4cbd-9b61-d78369646e83/lib.json"
vsphere_content_library_automatic_sync   = true
vsphere_content_library_on_demand        = false

# Virtual Machine Settings

vm_name                    = "ubuntu-test"
vm_cpus                    = 2
vm_memory                  = 4096
vm_disk_size               = 40960
vm_firmware                = "efi"
vm_guest_id                = "ubuntu64Guest"
vm_efi_secure_boot_enabled = true
vm_thin_provisioned        = true
vm_hostname                = "ubuntu-test"
vm_domain                  = "rainpole.io"
vm_ipv4_address            = "172.16.11.110"
vm_ipv4_netmask            = "24"
vm_ipv4_gateway            = "172.16.11.1"
vm_dns_suffix_list         = ["rainpole.io"]
vm_dns_server_list         = ["172.16.11.11", "172.16.11.12"]
```

### The Results

```console
❯ terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.vsphere_content_library.content_library will be read during apply
  # (config refers to values not yet known)
 <= data "vsphere_content_library" "content_library"  {
      + id   = (known after apply)
      + name = "m01-lib02"
    }

  # data.vsphere_content_library_item.content_library_item will be read during apply
  # (config refers to values not yet known)
 <= data "vsphere_content_library_item" "content_library_item"  {
      + id         = (known after apply)
      + library_id = (known after apply)
      + name       = "linux-ubuntu-18.04lts-v22.01"
      + type       = "ovf"
    }

  # time_sleep.nap will be created
  + resource "time_sleep" "nap" {
      + create_duration = "120s"
      + id              = (known after apply)
    }

  # vsphere_content_library.content_library will be created
  + resource "vsphere_content_library" "content_library" {
      + description     = "Subscribed Content Library for sfo-w02."
      + id              = (known after apply)
      + name            = "m01-lib02"
      + storage_backing = [
          + "datastore-11",
        ]

      + publication {
          + authentication_method = (known after apply)
          + password              = (known after apply)
          + publish_url           = (known after apply)
          + published             = (known after apply)
          + username              = (known after apply)
        }

      + subscription {
          + authentication_method = "NONE"
          + automatic_sync        = true
          + on_demand             = false
          + password              = (known after apply)
          + subscription_url      = "https://m01-vc01.rainpole.io:443/cls/vcsp/lib/93feb9f7-2926-4cbd-9b61-d78369646e83/lib.json"
          + username              = (known after apply)
        }
    }

  # vsphere_virtual_machine.vm will be created
  + resource "vsphere_virtual_machine" "vm" {
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-11"
      + default_ip_address                      = (known after apply)
      + efi_secure_boot_enabled                 = true
      + ept_rvi_mode                            = "automatic"
      + firmware                                = "efi"
      + folder                                  = "workloads"
      + force_power_off                         = true
      + guest_id                                = "ubuntu64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 4096
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "ubuntu-test"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 2
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6046"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + template_uuid = (known after apply)
          + timeout       = 30

          + customize {
              + dns_server_list = [
                  + "172.16.11.11",
                  + "172.16.11.12",
                ]
              + dns_suffix_list = [
                  + "rainpole.io",
                ]
              + ipv4_gateway    = "172.16.11.1"
              + timeout         = 10

              + linux_options {
                  + domain       = "rainpole.io"
                  + host_name    = "ubuntu-test"
                  + hw_clock_utc = true
                }

              + network_interface {
                  + ipv4_address = "172.16.11.110"
                  + ipv4_netmask = 24
                }
            }
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "datastore-11"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 40960
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
vsphere_content_library.content_library: Creating...
vsphere_content_library.content_library: Creation complete after 1s [id=9ddbef86-98e7-432f-95d9-23a1a68af197]
data.vsphere_content_library.content_library: Reading...
time_sleep.nap: Creating...
data.vsphere_content_library.content_library: Read complete after 0s [id=9ddbef86-98e7-432f-95d9-23a1a68af197]
time_sleep.nap: Still creating... [10s elapsed]
time_sleep.nap: Still creating... [20s elapsed]
time_sleep.nap: Still creating... [30s elapsed]
time_sleep.nap: Still creating... [40s elapsed]
time_sleep.nap: Still creating... [50s elapsed]
time_sleep.nap: Still creating... [1m0s elapsed]
time_sleep.nap: Still creating... [1m10s elapsed]
time_sleep.nap: Still creating... [1m20s elapsed]
time_sleep.nap: Still creating... [1m30s elapsed]
time_sleep.nap: Still creating... [1m40s elapsed]
time_sleep.nap: Still creating... [1m50s elapsed]
time_sleep.nap: Creation complete after 2m0s [id=2022-01-31T22:40:27Z]
data.vsphere_content_library_item.content_library_item: Reading...
data.vsphere_content_library_item.content_library_item: Read complete after 0s [id=6749253b-3c7b-44c8-86bb-b488e4866037]
vsphere_virtual_machine.vm: Creating...
vsphere_virtual_machine.vm: Still creating... [10s elapsed]
vsphere_virtual_machine.vm: Still creating... [20s elapsed]
vsphere_virtual_machine.vm: Still creating... [30s elapsed]
vsphere_virtual_machine.vm: Still creating... [40s elapsed]
vsphere_virtual_machine.vm: Still creating... [50s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m0s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m10s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m20s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m30s elapsed]
vsphere_virtual_machine.vm: Creation complete after 1m31s [id=42023f76-c8b9-852c-2192-c8b1a57c75cd]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

As you can see above, using `hashicorp/time` I put I created a `time_sleep` resource in which the `vsphere_content_library_item` data source is dependent, and in turn, the `time_sleep` resource is dependent on the ``vsphere_content_library` resource.

This provided the ability to create the subscribed content library, pause for 120 seconds while OVF templates synced, and then deploy a virtual machine from one of the OVF templates.

Generally, I'd recommend that these are resources are managed separately; however, the solution above demonstrates that the use case is entirely possible.

Ryan Johnson
Staff II Solutions Architect, VMware, Inc.
VMware Validated Solutions Engineering          
[credly.com/users/tenthirtyam](https://credly.com/users/tenthirtyam)

cc @appilon for issue and solution review